Autodesk.Revit.DB.IPerformanceAdviserRuleProxy.GetDescription
Retrieves the description of the rule.
Remarks:
Method should return a brief (one-two sentences) description of the rule. String should be localized.
Returns:
The description of the rule.
Since:
2012

Autodesk.Revit.DB.IPerformanceAdviserRuleProxy.GetName
Retrieves the name of the rule.
Remarks:
Method should return a short string naming the rule, typically as a one word in TitleCase. String should be localized.
Returns:
The name of the rule.
Since:
2012

Autodesk.Revit.DB.IPerformanceAdviserRuleProxy.GetElementFilter(Autodesk.Revit.DB.Document)
Retrieves a filter to restrict elements to be checked.
Remarks:
If the rule needs to be executed on individual elements,
it should return a filter that defines what elements the rule should apply to.
Otherwise, nothing (i.e. null) should be returned.
If filter is returned, it should stay valid till the end of the check.
document:
Document for which performance problems are being checked.
Returns:
The filter to restrict elements to be checked.
Since:
2012

Autodesk.Revit.DB.IPerformanceAdviserRuleProxy.WillCheckElements
Reports if rule needs to be executed on individual elements.
Returns:
True if rule needs to be executed on individual elements.
Since:
2012

Autodesk.Revit.DB.IPerformanceAdviserRuleProxy.ExecuteElementCheck(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element)
Invoked by performance advisor for each element to be checked.
document:
Document for which performance problems are being checked.
element:
The Element being checked for performance problems.
Since:
2012

Autodesk.Revit.DB.IPerformanceAdviserRuleProxy.FinalizeCheck(Autodesk.Revit.DB.Document)
Invoked by performance advisor once in the end of the check.
document:
Document for which performance problems are being checked.
Since:
2012

Autodesk.Revit.DB.IPerformanceAdviserRuleProxy.InitCheck(Autodesk.Revit.DB.Document)
Invoked by performance advisor once in the beginning of the check. If rule checks document as a whole,
the check can be performed in this method.
document:
Document for which performance problems are being checked.
Since:
2012